{
    "title": "MOFA: Discovering Materials for Carbon Capture with a GenAI- and Simulation-Based Workflow",
    "authors": [
        "Xiaoli Yan",
        "Nathaniel Hudson",
        "Hyun Park",
        "Daniel Grzenda",
        "J. Gregory Pauloski",
        "Marcus Schwarting",
        "Haochen Pan",
        "Hassan Harb",
        "Samuel Foreman",
        "Chris Knight",
        "Tom Gibbs",
        "Kyle Chard",
        "Santanu Chaudhuri",
        "Emad Tajkhorshid",
        "Ian Foster",
        "Mohamad Moosavi",
        "Logan Ward",
        "E. A. Huerta"
    ],
    "venue": "arXiv Preprint",
    "tldr": "We present MOFA, an open-source generative AI (GenAI) plus simulation workflow for high-throughput generation of metal-organic frameworks (MOFs) on large-scale high-performance computing (HPC) systems. MOFA addresses key challenges in integrating GPU-accelerated computing for GPU-intensive GenAI tasks, including distributed training and inference, alongside CPU- and GPU-optimized tasks for screening and filtering AI-generated MOFs using molecular dynamics, density functional theory, and Monte Carlo simulations. These heterogeneous tasks are unified within an online learning framework that optimizes the utilization of available CPU and GPU resources across HPC systems. Performance metrics from a 450-node (14,400 AMD Zen 3 CPUs + 1800 NVIDIA A100 GPUs) supercomputer run demonstrate that MOFA achieves high-throughput generation of novel MOF structures, with CO2 adsorption capacities ranking among the top 10 in the hypothetical MOF (hMOF) dataset. Furthermore, the production of high-quality MOFs exhibits a linear relationship with the number of nodes utilized. The modular architecture of MOFA will facilitate its integration into other scientific applications that dynamically combine GenAI with large-scale simulations.",
    "paper": "publications/yan2025mofa-preprint.pdf",
    "bibtex": "yan2025mofa",
    "code": "https://github.com/globus-labs/mof-generation-at-scale",
    "website": null,
    "poster": null,
    "slides": null,
    "preprint": "https://arxiv.org/abs/2501.10651",
    "publisher": null,
    "year": 2025,
    "month": 1,
    "selected": false,
    "category": "science"
}
